ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR1986VK01/src/MDR1986VK01_uart.c
    /* Transmit Data */
    UARTx->DR = (Data & (uint16_t)0x01FF);
}

/**
* @brief  Returns the most recent received data by the UARTx peripheral.
* @param  UARTx: Select the UART peripheral.
*         This parameter can be one of the following values:
*         UART1, UART2.
* @retval The received data (7:0) and error flags (15:8).
*/
uint16_t UART_ReceiveData(MDR_UART_TypeDef* UARTx)
{
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    
    /* Receive Data */
    return (uint16_t)(UARTx->DR);
}

/**
* @brief  Break transmit.
* @param  UARTx: Select the UART peripheral.
*         This parameter can be one of the following values:
*         UART1, UART2.
* @param  NewState: new state of the Line.
*         This parameter can be: ENABLE or DISABLE.
* @retval None
*/
void UART_BreakLine(MDR_UART_TypeDef* UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    
    if (NewState != DISABLE)
    {
        /* Set BRK bit in the UART LCR_H register */
        UARTx->LCR_H |= LCR_H_BRK_Set;
    }
    else
    {
        /* Reset BRK bit in the UART LCR_H register */
        UARTx->LCR_H |= LCR_H_BRK_Reset;
    }
}

/**
* @brief  Configures the UART’s IrDA interface.
* @param  UARTx: Select the UART peripheral.
*         This parameter can be one of the following values:
*         UART1, UART2.
* @param  UART_IrDAMode: specifies the IrDA mode.
*         This parameter can be one of the following values:
*           @arg UART_IrDAMode_LowPower
*           @arg UART_IrDAMode_Normal
* @retval None
*/
void UART_IrDAConfig(MDR_UART_TypeDef* UARTx, uint32_t UART_IrDAMode)
{
    uint32_t uartclock, clocksource, clockdiv;
    
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_IRDA_MODE(UART_IrDAMode));
    
    if (UART_IrDAMode == UART_IrDAMode_LowPower)
    {
        /* Configure the UART ILPR */
        switch( ( uint32_t )UARTx )
        {
        case ( uint32_t )MDR_UART0:
            clocksource = ( MDR_CLK->UART0_CLK >> 28 ) & 0xF;
            clockdiv = MDR_CLK->UART0_CLK & 0xFFFF;
            break;
        case ( uint32_t )MDR_UART1:
            clocksource = ( MDR_CLK->UART1_CLK >> 28 ) & 0xF;
            clockdiv = MDR_CLK->UART1_CLK & 0xFFFF;
            break;
        case ( uint32_t )MDR_UART2:
            clocksource = ( MDR_CLK->UART2_CLK >> 28 ) & 0xF;    
            clockdiv = MDR_CLK->UART2_CLK & 0xFFFF;
            break;
        case ( uint32_t )MDR_UART3:
            clocksource = ( MDR_CLK->UART3_CLK >> 28 ) & 0xF;   
            clockdiv = MDR_CLK->UART3_CLK & 0xFFFF;
            break;
        }    
        
        uartclock = CLK_GetSourceClk( clocksource ) / clockdiv;
        
        UARTx->ILPR = uartclock / IrLPBaud16;
    }
    UARTx->CR |= UART_IrDAMode;
}

/**
* @brief  Enables or disables the UART’s IrDA interface.
* @param  UARTx: Select the UART peripheral.
*         This parameter can be one of the following values:
*         UART1, UART2.
* @param  NewState: new state of the IrDA mode.
*         This parameter can be: ENABLE or DISABLE.
* @retval None
*/
void UART_IrDACmd(MDR_UART_TypeDef* UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    
    if (NewState != DISABLE)
    {
        /* Set SIREN bit in the UART CR register */
        UARTx->CR |= CR_SIREN_Set;
    }
    else
    {
        /* Reset SIREN bit in the UART CR register */
        UARTx->CR |= CR_SIREN_Reset;
    }
}

/**
* @brief  Checks whether the specified UART flag is set or not.
* @param  UARTx: Select the UART or the UART peripheral.
*         This parameter can be one of the following values:
*         UART1, UART2, UART3, UART4 or UART5.
* @param  UART_FLAG: specifies the flag to check.
*         This parameter can be one of the following values:
*           @arg UART_FLAG_RI  : nUARTRI line inverted value
*           @arg UART_FLAG_TXFE: Transmit buffer is empty flag
*           @arg UART_FLAG_RXFF: Receive buffer is full flag
*           @arg UART_FLAG_TXFF: Transmit buffer is full flag
*           @arg UART_FLAG_RXFE: Receive buffer is empty flag
*           @arg UART_FLAG_BUSY: Transmit Busy flag
*           @arg UART_FLAG_DCD:  nUARTDCD line inverted value
*           @arg UART_FLAG_DSR:  nUARTDSR line inverted value
*           @arg UART_FLAG_CTS:  nUARTCTS line inverted value
* @retval The new state of UART_FLAG (SET or RESET).
*/
FlagStatus UART_GetFlagStatus(MDR_UART_TypeDef* UARTx, uint32_t UART_FLAG)
{
    FlagStatus bitstatus;
    
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_FLAG(UART_FLAG));
    
    if (UARTx->FR & UART_FLAG)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
* @brief  Initializes the UARTx peripheral Clock according to the
*         specified parameters.
* @param  UARTx: Select the UART peripheral.
* @param  UART_BRG: specifies the HCLK division factor.
* @param  UART_CLK_SOURCE: specifies the HCLK clock sourse.
* @retval None
*/
void UART_BRGInit(MDR_UART_TypeDef* UARTx, uint16_t UART_BRG, uint32_t UART_CLK_SOURCE)
{
    
    /* Check the parameters */
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_CLOCK_SOURCE(UART_CLK_SOURCE));
    
    switch( ( uint32_t )UARTx )
    {
    case ( uint32_t )MDR_UART0:
        MDR_CLK->PER0_CLK |= 1 << 26;
        MDR_CLK->UART0_CLK = UART_CLK_SOURCE << 28 | 1<<16 | UART_BRG;
        break;
    case ( uint32_t )MDR_UART1:
        MDR_CLK->PER0_CLK |= 1 << 27;
        MDR_CLK->UART1_CLK = UART_CLK_SOURCE << 28 | 1<<16 | UART_BRG;        
        break;
    case ( uint32_t )MDR_UART2:
        MDR_CLK->PER0_CLK |= 1 << 28;
        MDR_CLK->UART2_CLK = UART_CLK_SOURCE << 28 | 1<<16 | UART_BRG;        
        break;
    case ( uint32_t )MDR_UART3:
        MDR_CLK->PER0_CLK |= 1 << 29;
        MDR_CLK->UART3_CLK = UART_CLK_SOURCE << 28 | 1<<16 | UART_BRG;        
        break;
    }
    
}

/** @} */ /* End of group UART_Private_Functions */

/** @} */ /* End of group UART */

/** @} */ /* End of group __MDR1986VK01_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2022 Milandr *********************************
*
* END OF FILE MDR1986VK01_uart.c */


